package d_chapter01;

//		데이터 
//		: 세계에 존재하는 정보를 총징( 컴퓨터의 저장 장치에 기록된 정보) 
//		: 컴퓨터는 기계어를 통해 데이터를 인식하고 처리 

public class A_variable {

	public static void main(String[] args) {
		//  변수 (Variable) 
		// : 데이터를 저장할수 있는 메모리 '공간'

//			변수 선언 
//			: 메모리 공간을 생성 
//			: 컴퓨터에게 데이터를 가져올 상자를 알려줌 
//			: >> 컴퓨터는 '상자'안에 있는 내용물을 가져다줌
		
//			변수 선언 방법 
// 		: 데이터타입 변수명; 
		
//			변수 초기화 방법:  상자에 데이터를 담는 것 
//			변수명 = 데이터값; 
//			: 프로그래밍에서 =(동호1개)느느 우황의 값을 좌형에 대입한다, 
//			: 프로그래밍에서 '갈다'르르 나타내는 기호: == 
		
//			변수 선언과 동시에 초기화 
//			데이터타입 변수명 = 데이터값;
		
// 	5. 변수 명명 규칙
//		- 문자, 숫가, 숫자, 기호를 사용 
//		- 대소문자가 구분, 길이에 제한이 X
//			: name, name 서로 다름 .
//			- 숫자로 시작할수 X
// 			: top10(가능), 7yop (불가능) 
//			- 기호는 _(언더 스코어), $(달러)만 가능 
//					: _hello, $hi
//			- 카멜케이스를 사용 
//					: 시작단어는 소문자로 시작, 이어지는 단어는 대문자로 시작 
//					studentName, scoreTotal
//				-전체 대문자 사용을 지양(사용X) 
//				 : 상수외ㅏ 구분하기 위함 
// 		- 자막의 예약어, 키워드는 변수명으로 사용 X 
//				: if, far, class, byte 등등 
		
			// 상수 (constant)
			// : 프로그램 실행 동안 그 같이 변경되지 않은 변수를 의미 
			//: 선언과 동시에 반드시 초기화가 이루여져야함 
		
//			1. 상수 선언 및 초기화
//			: 자바에서는 final 키워드를 사용하여 상수를 선언 
		

//			2. 상수의특징 
//			- 초기화 이후에는 값을 변경할수 X 
//			- 보통 대문자로 명명
//			- 일반적으로 공개된 값이나 변경되지 않은 값들을 정의할 떄 사용
//  		: 파이(PI: 3.14159)
//			:final 데이터타입 PI = 3.14159
//			: final 데이터 파이 RESIDNET_NUMBER = 12345678;
		
//			3. 상수 명명 규칙 
//			- 전체 대문자로 명명을 권장 
//			- 스네이크
		
		
		
		
	}

}
